app/controllers/songs_controller.rb

  def index
   # binding.pry
    if params[:artist_id] && @a = Artist.find_by(id: params[:artist_id])
      @songs = @a.songs
    elsif params[:artist_id] && !Artist.find_by(id: params[:artist_id])
      flash[:alert] = "Artist not found"
      redirect_to artists_path
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"

  def show
    #binding.pry
    if params[:artist_id] && !Song.find_by(id: params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]